{"preGame":"Each of these is a buzzer beater shot where the game is on the line. If they miss, they lose. If they make it, they win, against all odds.","swing":[{"type":"text","value":"Basketball games are filled with high-pressure moments, but none more thrilling than the last-second shots that can snatch victory from defeat. We're diving into these make-or-break moments with a stat called win probability. It's like a game of tug of war where each team's chances of winning shift with the time left and the game's closeness. The goal is to get your team over the 100% line."},{"type":"tug","start":"50","end":"100"},{"type":"text","value":"Most shots in a game only pull slightly at the win probability tug of war. But we're zeroing in on the big tugs, those clutch plays that reveal something about pressure-filled moments. These are the instances that can tilt the balance. Let's take a look at a real game to see how these moments unfold."},{"type":"clip","id":"derozan-miss"},{"type":"tug","start":"42.4","make":"57.3","miss":"32.4","end":"32.4"},{"type":"text","value":"In this clip, DeRozan is faced with a high-pressure shot. If he had made it, the Bulls would have taken the lead, with a win probability of 57.3%. But with the miss, they remain behind, and the win probability dips to 32.4%. This 24.9% difference between these two potential outcomes is what we call the swing, and it's a key statistic we'll be examining. It's a tangible measurement of what was at stake in that specific moment. This shot is significant, falling within the top 1% of swing values, classifying it as a clutch moment."},{"type":"clip","id":"derozan-make"},{"type":"tug","start":"36.1","make":"97.1","miss":"1.5","end":"97.1"},{"type":"text","value":"Now, contrast that miss with this electrifying moment: DeRozan nails a buzzer-beater, tugging the Bulls' win probability to an astonishing 100%. The swing here is a massive 96% - if he had missed, their win probability would have plummeted to near zero. This is a textbook example of the biggest swing possible in a game. The very essence of a do-or-die moment, distilled into data."}]}